ChibiOS/ChibiOS/os/hal/ports/STM32/STM32U3xx/hal_lld.h
/*
    ChibiOS - Copyright (C) 2006..2018 Giovanni Di Sirio

    Licensed under the Apache License, Version 2.0 (the "License");
    you may not use this file except in compliance with the License.
    You may obtain a copy of the License at

        http://www.apache.org/licenses/LICENSE-2.0

    Unless required by applicable law or agreed to in writing, software
    distributed under the License is distributed on an "AS IS" BASIS,
    WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
    See the License for the specific language governing permissions and
    limitations under the License.
*/

/**
 * @file    STM32H5xx/hal_lld.h
 * @brief   STM32H5xx HAL subsystem low level driver header.
 * @pre     This module requires the following macros to be defined in the
 *          @p board.h file:
 *          - STM32_LSECLK.
 *          - STM32_LSEDRV.
 *          - STM32_LSE_BYPASS (optionally).
 *          - STM32_HSECLK.
 *          - STM32_HSE_BYPASS (optionally).
 *          - STM32_HSE_DIGITAL (optionally).
 *          .
 *          One of the following macros must also be defined:
 *          - STM32U375xx, STM32U385xx.
 *          .
 *
 * @addtogroup HAL
 * @{
 */

#ifndef HAL_LLD_H
#define HAL_LLD_H

#include "stm32_registry.h"

/*===========================================================================*/
/* Driver constants.                                                         */
/*===========================================================================*/

/**
 * @brief   Requires use of SPIv2 driver model.
 */
#define HAL_LLD_SELECT_SPI_V2           TRUE

/**
 * @name    Platform identification
 * @{
 */
#if defined(STM32U375xx) || defined(__DOXYGEN__)
  #define PLATFORM_NAME         "STM32U3 Low-power"

#elif defined(STM32U385xx)
  #define PLATFORM_NAME         "STM32U3 Low-power with Crypto"

#else
  #error "STM32U3 device not specified"
#endif

/**
 * @brief   Sub-family identifier.
 */
#if !defined(STM32U3XX) || defined(__DOXYGEN__)
  #define STM32U3XX
#endif
/** @} */

/**
 * @name   Clock points names
 * @{
 */
#define CLK_HSI16               0U
#define CLK_HSI48               1U
#define CLK_HSE                 2U
#define CLK_MSIS                3U
#define CLK_MSIK                4U
#define CLK_SYSCLK              5U
#define CLK_HCLK                6U
#define CLK_PCLK1               7U
#define CLK_PCLK1TIM            8U
#define CLK_PCLK2               9U
#define CLK_PCLK2TIM            10U
#define CLK_PCLK3               11U
#define CLK_MCO1                12U
#define CLK_MCO2                13U
#define CLK_ARRAY_SIZE          14U
/** @} */

/**
 * @name    MSIRC0 96MHz oscillator settings
 * @{
 */
#define STM32_MSIRC0_FREE       0
#define STM32_MSIRC0_PLL_LSE    1
#define STM32_MSIRC0_PLL_HSE    2
#define STM32_MSIRC0_PLL_LSE_FAST 3
#define STM32_MSIRC0_PLL_HSE_FAST 4
/** @} */

/**
 * @name    MSIRC1 24MHz oscillator settings
 * @{
 */
#define STM32_MSIRC1_FREE       0
#define STM32_MSIRC1_PLL_LSE    1
#define STM32_MSIRC1_PLL_HSE    2
#define STM32_MSIRC1_PLL_LSE_FAST 3
#define STM32_MSIRC1_PLL_HSE_FAST 4
/** @} */

/**
 * @name    Source and divider for MSIS
 * @{
 */
#define STM32_MSIS_IRC0_DIV1    0       /* 96MHz */
#define STM32_MSIS_IRC0_DIV2    1       /* 48MHz */
#define STM32_MSIS_IRC0_DIV4    2       /* 24MHz */
#define STM32_MSIS_IRC0_DIV8    3       /* 12MHz */
#define STM32_MSIS_IRC1_DIV1    4       /* ~24MHz */
#define STM32_MSIS_IRC1_DIV3    5       /* ~12MHz */
#define STM32_MSIS_IRC1_DIV4    6       /* ~6MHz */
#define STM32_MSIS_IRC1_DIV8    7       /* ~4MHz */
/** @} */

/**
 * @name    Source and divider for MSIK
 * @{
 */
#define STM32_MSIK_IRC0_DIV1    0       /* 96MHz */
#define STM32_MSIK_IRC0_DIV2    1       /* 48MHz */
#define STM32_MSIK_IRC0_DIV4    2       /* 24MHz */
#define STM32_MSIK_IRC0_DIV8    3       /* 12MHz */
#define STM32_MSIK_IRC1_DIV1    4       /* ~24MHz */
#define STM32_MSIK_IRC1_DIV3    5       /* ~12MHz */
#define STM32_MSIK_IRC1_DIV4    6       /* ~6MHz */
#define STM32_MSIK_IRC1_DIV8    7       /* ~4MHz */
/** @} */

/**
 * @name    PWR_VOSR register definitions
 * @{
 */
#define STM32_VOS_POS           0
#define STM32_VOS_MASK          (3U << 0)
#define STM32_VOS_RANGE1        (1U << PWR_VOSR_R1EN_Pos)
#define STM32_VOS_RANGE2        (1U << PWR_VOSR_R2EN_Pos)
/** @} */

/**
 * @name    PWR_CR3 register definitions
 * @{
 */
#define STM32_REGSEL            (1U << PWR_CR3_REGSEL_Pos)

#define STM32_FSTEN             (1U << PWR_CR3_FSTEN_Pos)
/** @} */

/**
 * @name    PWR_SVMCR register definitions
 * @{
 */
#define STM32_ASV               PWR_SVMCR_ASV
#define STM32_IO2SV             PWR_SVMCR_IO2SV
#define STM32_USV               PWR_SVMCR_USV
#define STM32_AVM2EN            PWR_SVMCR_AVM2EN
#define STM32_AVM1EN            PWR_SVMCR_AVM1EN
#define STM32_IO2VMEN           PWR_SVMCR_IO2VMEN
#define STM32_UVMEN             PWR_SVMCR_UVMEN
#define STM32_PVDLS_POS         PWR_SVMCR_PVDLS_Pos
#define STM32_PVDLS_MASK        PWR_SVMCR_PVDLS_Msk
#define STM32_PVDLS_FIELD(n)    ((n) << STM32_PVDLS_POS)
#define STM32_PVDLS_2P0V        STM32_PVDLS_FIELD(0U)
#define STM32_PVDLS_2P2V        STM32_PVDLS_FIELD(1U)
#define STM32_PVDLS_2P4V        STM32_PVDLS_FIELD(2U)
#define STM32_PVDLS_2P5V        STM32_PVDLS_FIELD(3U)
#define STM32_PVDLS_2P6V        STM32_PVDLS_FIELD(4U)
#define STM32_PVDLS_2P8V        STM32_PVDLS_FIELD(5U)
#define STM32_PVDLS_2P9V        STM32_PVDLS_FIELD(6U)
#define STM32_PVDLS_PVD_IN      STM32_PVDLS_FIELD(7U)
#define STM32_PVDE              PWR_SVMCR_PVDE
/** @} */

/**
 * @name    FLASH_ACR register bits definitions
 * @{
 */
#define STM32_LATENCY_POS       FLASH_ACR_LATENCY_Pos
#define STM32_LATENCY_MASK      FLASH_ACR_LATENCY_Msk
#define STM32_LATENCY_FIELD(n)  ((n) << STM32_LATENCY_POS)
#define STM32_LATENCY_0WS       STM32_LATENCY_FIELD(0U)
#define STM32_LATENCY_1WS       STM32_LATENCY_FIELD(1U)
#define STM32_LATENCY_2WS       STM32_LATENCY_FIELD(2U)
#define STM32_LATENCY_3WS       STM32_LATENCY_FIELD(3U)
#define STM32_LATENCY_4WS       STM32_LATENCY_FIELD(4U)

#define STM32_PRFTEN            FLASH_ACR_PRFTEN
#define STM32_LPM               FLASH_ACR_LPM
#define STM32_PDREQ1            FLASH_ACR_PDREQ1
#define STM32_PDREQ2            FLASH_ACR_PDREQ2
#define STM32_SLEEP_PD          FLASH_ACR_SLEEP_PD
/** @} */

/**
 * @name    RCC_ICSCR1 register bits definitions
 * @{
 */
#define STM32_MSIHSINDIV_POS    RCC_ICSCR1_MSIHSINDIV_Pos
#define STM32_MSIHSINDIV_MASK   RCC_ICSCR1_MSIHSINDIV_Msk
#define STM32_MSIHSINDIV_FIELD(n) ((n) << STM32_MSIHSINDIV_POS)
#define STM32_MSIHSINDIV_HSE16  STM32_MSIHSINDIV_FIELD(0U)
#define STM32_MSIHSINDIV_HSE32  STM32_MSIHSINDIV_FIELD(1U)

#define STM32_MSIPLL1SEL_POS    RCC_ICSCR1_MSIPLL1SEL_Pos
#define STM32_MSIPLL1SEL_MASK   RCC_ICSCR1_MSIPLL1SEL_Msk
#define STM32_MSIPLL1SEL_FIELD(n) ((n) << STM32_MSIPLL1SEL_POS)
#define STM32_MSIPLL1SEL_LSE    STM32_MSIPLL1SEL_FIELD(0U)
#define STM32_MSIPLL1SEL_HSE    STM32_MSIPLL1SEL_FIELD(1U)

#define STM32_MSIPLL0SEL_POS    RCC_ICSCR1_MSIPLL0SEL_Pos
#define STM32_MSIPLL0SEL_MASK   RCC_ICSCR1_MSIPLL0SEL_Msk
#define STM32_MSIPLL0SEL_FIELD(n) ((n) << STM32_MSIPLL0SEL_POS)
#define STM32_MSIPLL0SEL_LSE    STM32_MSIPLL0SEL_FIELD(0U)
#define STM32_MSIPLL0SEL_HSE    STM32_MSIPLL0SEL_FIELD(1U)

#define STM32_MSIBIAS_POS       RCC_ICSCR1_MSIBIAS_Pos
#define STM32_MSIBIAS_MASK      RCC_ICSCR1_MSIBIAS_Msk
#define STM32_MSIBIAS_FIELD(n)  ((n) << STM32_MSIBIAS_POS)
#define STM32_MSIBIAS_CONTINUOUS STM32_MSIBIAS_FIELD(0U)
#define STM32_MSIBIAS_SAMPLIG   STM32_MSIBIAS_FIELD(1U)

#define STM32_MSIRGSEL_POS      RCC_ICSCR1_MSIRGSEL_Pos
#define STM32_MSIRGSEL_MASK     RCC_ICSCR1_MSIRGSEL_Msk
#define STM32_MSIRGSEL_FIELD(n) ((n) << STM32_MSIRGSEL_POS)
#define STM32_MSIRGSEL_CSR      STM32_MSIRGSEL_FIELD(0U)
#define STM32_MSIRGSEL_ICSCR1   STM32_MSIRGSEL_FIELD(1U)

#define STM32_MSIPLL1N_POS      RCC_ICSCR1_MSIPLL1N_Pos
#define STM32_MSIPLL1N_MASK     RCC_ICSCR1_MSIPLL1N_Msk
#define STM32_MSIPLL1N_FIELD(n) ((n) << STM32_MSIPLL1N_POS)

#define STM32_MSIKDIV_POS       RCC_ICSCR1_MSIKDIV_Pos
#define STM32_MSIKDIV_MASK      RCC_ICSCR1_MSIKDIV_Msk
#define STM32_MSIKDIV_FIELD(n)  ((n) << STM32_MSIKDIV_POS)

#define STM32_MSIKSEL_POS       RCC_ICSCR1_MSIKSEL_Pos
#define STM32_MSIKSEL_MASK      RCC_ICSCR1_MSIKSEL_Msk
#define STM32_MSIKSEL_FIELD(n)  ((n) << STM32_MSIKSEL_POS)
#define STM32_MSIKSEL_MSIRC0    STM32_MSIKSEL_FIELD(0U)
#define STM32_MSIKSEL_MSIRC1    STM32_MSIKSEL_FIELD(1U)

#define STM32_MSISDIV_POS       RCC_ICSCR1_MSISDIV_Pos
#define STM32_MSISDIV_MASK      RCC_ICSCR1_MSISDIV_Msk
#define STM32_MSISDIV_FIELD(n)  ((n) << STM32_MSISDIV_POS)

#define STM32_MSISSEL_POS       RCC_ICSCR1_MSISSEL_Pos
#define STM32_MSISSEL_MASK      RCC_ICSCR1_MSISSEL_Msk
#define STM32_MSISSEL_FIELD(n)  ((n) << STM32_MSISSEL_POS)
#define STM32_MSISSEL_MSIRC0    STM32_MSISSEL_FIELD(0U)
#define STM32_MSISSEL_MSIRC1    STM32_MSISSEL_FIELD(1U)
/** @} */

/**
 * @name    RCC_CFGR1 register bits definitions
 * @{
 */
#define STM32_SW_POS            RCC_CFGR1_SW_Pos
#define STM32_SW_MASK           RCC_CFGR1_SW_Msk
#define STM32_SW_FIELD(n)       ((n) << STM32_SW_POS)
#define STM32_SW_MSIS           STM32_SW_FIELD(0U)
#define STM32_SW_HSI16          STM32_SW_FIELD(1U)
#define STM32_SW_HSE            STM32_SW_FIELD(2U)

