ChibiOS/ChibiOS/os/hal/ports/STM32/STM32U3xx/hal_lld.h
#define STM32_SWS_POS           RCC_CFGR1_SWS_Pos
#define STM32_SWS_MASK          RCC_CFGR1_SWS_Msk
#define STM32_SWS_FIELD(n)      ((n) << STM32_SWS_POS)
#define STM32_SWS_MSIS          STM32_SWS_FIELD(0U)
#define STM32_SWS_HSI16         STM32_SWS_FIELD(1U)
#define STM32_SWS_HSE           STM32_SWS_FIELD(2U)

#define STM32_STOPWUCK_POS      RCC_CFGR1_STOPWUCK_Pos
#define STM32_STOPWUCK_MASK     RCC_CFGR1_STOPWUCK_Msk
#define STM32_STOPWUCK_FIELD(n) ((n) << STM32_STOPWUCK_POS)
#define STM32_STOPWUCK_MSIS     STM32_STOPWUCK_FIELD(0U)
#define STM32_STOPWUCK_HSI16    STM32_STOPWUCK_FIELD(1U)

#define STM32_STOPKERWUCK_POS   RCC_CFGR1_STOPKERWUCK_Pos
#define STM32_STOPKERWUCK_MASK  RCC_CFGR1_STOPKERWUCK_Msk
#define STM32_STOPKERWUCK_FIELD(n) ((n) << STM32_STOPKERWUCK_POS)
#define STM32_STOPKERWUCK_MSIK  STM32_STOPKERWUCK_FIELD(0U)
#define STM32_STOPKERWUCK_HSI16 STM32_STOPKERWUCK_FIELD(1U)

#define STM32_MCO1SEL_POS       RCC_CFGR1_MCOSEL_Pos
#define STM32_MCO1SEL_MASK      RCC_CFGR1_MCOSEL_Msk
#define STM32_MCO1SEL_FIELD(n)  ((n) << STM32_MCO1SEL_POS)
#define STM32_MCO1SEL_OFF       STM32_MCO1PRE_FIELD(0U)
#define STM32_MCO1SEL_SYSCLK    STM32_MCO1PRE_FIELD(1U)
#define STM32_MCO1SEL_MSIS      STM32_MCO1PRE_FIELD(2U)
#define STM32_MCO1SEL_HSI16     STM32_MCO1PRE_FIELD(3U)
#define STM32_MCO1SEL_HSE       STM32_MCO1PRE_FIELD(4U)
#define STM32_MCO1SEL_LSI       STM32_MCO1PRE_FIELD(5U)
#define STM32_MCO1SEL_LSE       STM32_MCO1PRE_FIELD(6U)
#define STM32_MCO1SEL_HSI48     STM32_MCO1PRE_FIELD(7U)
#define STM32_MCO1SEL_MSIK      STM32_MCO1PRE_FIELD(8U)

#define STM32_MCO1PRE_POS       RCC_CFGR1_MCOPRE_Pos
#define STM32_MCO1PRE_MASK      RCC_CFGR1_MCOPRE_Msk
#define STM32_MCO1PRE_FIELD(n)  ((n) << STM32_MCO1PRE_POS)
#define STM32_MCO1PRE_DIV1      STM32_MCO1PRE_FIELD(0U)
#define STM32_MCO1PRE_DIV2      STM32_MCO1PRE_FIELD(1U)
#define STM32_MCO1PRE_DIV4      STM32_MCO1PRE_FIELD(2U)
#define STM32_MCO1PRE_DIV8      STM32_MCO1PRE_FIELD(3U)
#define STM32_MCO1PRE_DIV16     STM32_MCO1PRE_FIELD(4U)
#define STM32_MCO1PRE_DIV32     STM32_MCO1PRE_FIELD(5U)
#define STM32_MCO1PRE_DIV64     STM32_MCO1PRE_FIELD(6U)
#define STM32_MCO1PRE_DIV128    STM32_MCO1PRE_FIELD(7U)

#define STM32_MCO2SEL_POS       RCC_CFGR1_MCO2SEL_Pos
#define STM32_MCO2SEL_MASK      RCC_CFGR1_MCO2SEL_Msk
#define STM32_MCO2SEL_FIELD(n)  ((n) << STM32_MCO2SEL_POS)
#define STM32_MCO2SEL_OFF       STM32_MCO2SEL_FIELD(0U)
#define STM32_MCO2SEL_SYSCLK    STM32_MCO2SEL_FIELD(1U)
#define STM32_MCO2SEL_MSIS      STM32_MCO2SEL_FIELD(2U)
#define STM32_MCO2SEL_HSI16     STM32_MCO2SEL_FIELD(3U)
#define STM32_MCO2SEL_HSE       STM32_MCO2SEL_FIELD(4U)
#define STM32_MCO2SEL_LSI       STM32_MCO2SEL_FIELD(5U)
#define STM32_MCO2SEL_LSE       STM32_MCO2SEL_FIELD(6U)
#define STM32_MCO2SEL_HSI48     STM32_MCO2SEL_FIELD(7U)
#define STM32_MCO2SEL_MSIK      STM32_MCO2SEL_FIELD(8U)

#define STM32_MCO2PRE_POS       RCC_CFGR1_MCO2PRE_Pos
#define STM32_MCO2PRE_MASK      RCC_CFGR1_MCO2PRE_Msk
#define STM32_MCO2PRE_FIELD(n)  ((n) << STM32_MCO2PRE_POS)
#define STM32_MCO2PRE_DIV1      STM32_MCO2PRE_FIELD(0U)
#define STM32_MCO2PRE_DIV2      STM32_MCO2PRE_FIELD(1U)
#define STM32_MCO2PRE_DIV4      STM32_MCO2PRE_FIELD(2U)
#define STM32_MCO2PRE_DIV8      STM32_MCO2PRE_FIELD(3U)
#define STM32_MCO2PRE_DIV16     STM32_MCO2PRE_FIELD(4U)
#define STM32_MCO2PRE_DIV32     STM32_MCO2PRE_FIELD(5U)
#define STM32_MCO2PRE_DIV64     STM32_MCO2PRE_FIELD(6U)
#define STM32_MCO2PRE_DIV128    STM32_MCO2PRE_FIELD(7U)
/** @} */

/**
 * @name    RCC_CFGR4 register bits definitions
 * @{
 */
#define STM32_BOOSTSEL_POS      RCC_CFGR4_BOOSTSEL_Pos
#define STM32_BOOSTSEL_MASK     RCC_CFGR4_BOOSTSEL_Msk
#define STM32_BOOSTSEL_FIELD(n) ((n) << STM32_BOOSTSEL_POS)
#define STM32_BOOSTSEL_NOCLOCK  STM32_BOOSTSEL_FIELD(0U)
#define STM32_BOOSTSEL_MSIS     STM32_BOOSTSEL_FIELD(1U)
#define STM32_BOOSTSEL_HSI16    STM32_BOOSTSEL_FIELD(2U)
#define STM32_BOOSTSEL_HSE      STM32_BOOSTSEL_FIELD(3U)

#define STM32_BOOSTDIV_POS      RCC_CFGR4_BOOSTDIV_Pos
#define STM32_BOOSTDIV_MASK     RCC_CFGR4_BOOSTDIV_Msk
#define STM32_BOOSTDIV_FIELD(n) ((n) << STM32_BOOSTDIV_POS)
#define STM32_BOOSTDIV_DIV1     STM32_BOOSTDIV_FIELD(0U)
#define STM32_BOOSTDIV_DIV2     STM32_BOOSTDIV_FIELD(1U)
#define STM32_BOOSTDIV_DIV4     STM32_BOOSTDIV_FIELD(2U)
#define STM32_BOOSTDIV_DIV6     STM32_BOOSTDIV_FIELD(3U)
#define STM32_BOOSTDIV_DIV8     STM32_BOOSTDIV_FIELD(4U)
#define STM32_BOOSTDIV_DIV10    STM32_BOOSTDIV_FIELD(5U)
#define STM32_BOOSTDIV_DIV12    STM32_BOOSTDIV_FIELD(6U)
#define STM32_BOOSTDIV_DIV14    STM32_BOOSTDIV_FIELD(7U)
#define STM32_BOOSTDIV_DIV16    STM32_BOOSTDIV_FIELD(8U)
/** @} */

/**
 * @name    RCC_CCIPR1 register bits definitions
 * @{
 */
#define STM32_USART1SEL_POS     0
#define STM32_USART1SEL_MASK    (1U << STM32_USART1SEL_POS)
#define STM32_USART1SEL_FIELD(n) ((n) << STM32_USART1SEL_POS)
#define STM32_USART1SEL_PCLK2   STM32_USART1SEL_FIELD(0U)
#define STM32_USART1SEL_HSI16   STM32_USART1SEL_FIELD(1U)

#define STM32_USART3SEL_POS     2
#define STM32_USART3SEL_MASK    (1U << STM32_USART3SEL_POS)
#define STM32_USART3SEL_FIELD(n) ((n) << STM32_USART3SEL_POS)
#define STM32_USART3SEL_PCLK1   STM32_USART3SEL_FIELD(0U)
#define STM32_USART3SEL_HSI16   STM32_USART3SEL_FIELD(1U)

#define STM32_UART4SEL_POS      4
#define STM32_UART4SEL_MASK     (1U << STM32_UART4SEL_POS)
#define STM32_UART4SEL_FIELD(n) ((n) << STM32_UART4SEL_POS)
#define STM32_UART4SEL_PCLK1    STM32_UART4SEL_FIELD(0U)
#define STM32_UART4SEL_HSI16    STM32_UART4SEL_FIELD(1U)

#define STM32_UART5SEL_POS      6
#define STM32_UART5SEL_MASK     (1U << STM32_UART5SEL_POS)
#define STM32_UART5SEL_FIELD(n) ((n) << STM32_UART5SEL_POS)
#define STM32_UART5SEL_PCLK1    STM32_UART5SEL_FIELD(0U)
#define STM32_UART5SEL_HSI16    STM32_UART5SEL_FIELD(1U)

#define STM32_I3C1SEL_POS       8
#define STM32_I3C1SEL_MASK      (1U << STM32_I3C1SEL_POS)
#define STM32_I3C1SEL_FIELD(n)  ((n) << STM32_I3C1SEL_POS)
#define STM32_I3C1SEL_PCLK1     STM32_I3C1SEL_FIELD(0U)
#define STM32_I3C1SEL_MSIK      STM32_I3C1SEL_FIELD(1U)

