ChibiOS/ChibiOS/os/hal/ports/STM32/STM32U3xx/hal_lld.h
#define STM32_I2C1SEL_POS       10
#define STM32_I2C1SEL_MASK      (1U << STM32_I2C1SEL_POS)
#define STM32_I2C1SEL_FIELD(n)  ((n) << STM32_I2C1SEL_POS)
#define STM32_I2C1SEL_PCLK1     STM32_I2C1SEL_FIELD(0U)
#define STM32_I2C1SEL_MSIK      STM32_I2C1SEL_FIELD(1U)

#define STM32_I2C2SEL_POS       12
#define STM32_I2C2SEL_MASK      (1U << STM32_I2C2SEL_POS)
#define STM32_I2C2SEL_FIELD(n)  ((n) << STM32_I2C2SEL_POS)
#define STM32_I2C2SEL_PCLK1     STM32_I2C2SEL_FIELD(0U)
#define STM32_I2C2SEL_MSIK      STM32_I2C2SEL_FIELD(1U)

#define STM32_I3C2SEL_POS       14
#define STM32_I3C2SEL_MASK      (1U << STM32_I3C2SEL_POS)
#define STM32_I3C2SEL_FIELD(n)  ((n) << STM32_I3C2SEL_POS)
#define STM32_I3C2SEL_PCLK3     STM32_I3C2SEL_FIELD(0U)
#define STM32_I3C2SEL_MSIK      STM32_I3C2SEL_FIELD(1U)

#define STM32_SPI2SEL_POS       16
#define STM32_SPI2SEL_MASK      (1U << STM32_SPI2SEL_POS)
#define STM32_SPI2SEL_FIELD(n)  ((n) << STM32_SPI2SEL_POS)
#define STM32_SPI2SEL_PCLK1     STM32_SPI2SEL_FIELD(0U)
#define STM32_SPI2SEL_MSIK      STM32_SPI2SEL_FIELD(1U)

#define STM32_LPTIM2SEL_POS     18
#define STM32_LPTIM2SEL_MASK    (3U << STM32_LPTIM2SEL_POS)
#define STM32_LPTIM2SEL_FIELD(n) ((n) << STM32_LPTIM2SEL_POS)
#define STM32_LPTIM2SEL_PCLK1   STM32_LPTIM2SEL_FIELD(0U)
#define STM32_LPTIM2SEL_LSI     STM32_LPTIM2SEL_FIELD(1U)
#define STM32_LPTIM2SEL_HSI16   STM32_LPTIM2SEL_FIELD(2U)
#define STM32_LPTIM2SEL_LSE     STM32_LPTIM2SEL_FIELD(3U)

#define STM32_SPI1SEL_POS       20
#define STM32_SPI1SEL_MASK      (1U << STM32_SPI1SEL_POS)
#define STM32_SPI1SEL_FIELD(n)  ((n) << STM32_SPI1SEL_POS)
#define STM32_SPI1SEL_PCLK2     STM32_SPI1SEL_FIELD(0U)
#define STM32_SPI1SEL_MSIK      STM32_SPI1SEL_FIELD(1U)

#define STM32_SYSTICKSEL_POS    22
#define STM32_SYSTICKSEL_MASK   (3U << STM32_SYSTICKSEL_POS)
#define STM32_SYSTICKSEL_FIELD(n) ((n) << STM32_SYSTICKSEL_POS)
#define STM32_SYSTICKSEL_HCLKDIV8 STM32_SYSTICKSEL_FIELD(0U)
#define STM32_SYSTICKSEL_LSI    STM32_SYSTICKSEL_FIELD(1U)
#define STM32_SYSTICKSEL_LSE    STM32_SYSTICKSEL_FIELD(2U)

#define STM32_FDCAN1SEL_POS     24
#define STM32_FDCAN1SEL_MASK    (1U << STM32_FDCAN1SEL_POS)
#define STM32_FDCAN1SEL_FIELD(n) ((n) << STM32_FDCAN1SEL_POS)
#define STM32_FDCAN1SEL_IGNORE  0xFFFFFFFFU
#define STM32_FDCAN1SEL_SYSCLK  STM32_FDCAN1SEL_FIELD(0U)
#define STM32_FDCAN1SEL_MSIK    STM32_FDCAN1SEL_FIELD(1U)

#define STM32_ICLKSEL_POS       26
#define STM32_ICLKSEL_MASK      (3U << STM32_ICLKSEL_POS)
#define STM32_ICLKSEL_FIELD(n)  ((n) << STM32_ICLKSEL_POS)
#define STM32_ICLKSEL_HSI48     STM32_ICLKSEL_FIELD(0U)
#define STM32_ICLKSEL_MSIK      STM32_ICLKSEL_FIELD(1U)
#define STM32_ICLKSEL_HSE       STM32_ICLKSEL_FIELD(2U)
#define STM32_ICLKSEL_SYSCLK    STM32_ICLKSEL_FIELD(3U)

#define STM32_USB1SEL_POS       28
#define STM32_USB1SEL_MASK      (1U << STM32_USB1SEL_POS)
#define STM32_USB1SEL_FIELD(n)  ((n) << STM32_USB1SEL_POS)
#define STM32_USB1SEL_ICLK      STM32_USB1SEL_FIELD(0U)
#define STM32_USB1SEL_ICLKDIV2  STM32_USB1SEL_FIELD(1U)

#define STM32_TIMICSEL_POS      29
#define STM32_TIMICSEL_MASK     (7U << STM32_TIMICSEL_POS)
#define STM32_TIMICSEL_FIELD(n) ((n) << STM32_TIMICSEL_POS)
#define STM32_TIMICSEL_NOCLOCK                  STM32_TIMICSEL_FIELD(0U)
#define STM32_TIMICSEL_HSI256_MSIS1024_MSIS4    STM32_TIMICSEL_FIELD(4U)
#define STM32_TIMICSEL_HSI256_MSIS1024_MSIK4    STM32_TIMICSEL_FIELD(5U)
#define STM32_TIMICSEL_HSI256_MSIK1024_MSIS4    STM32_TIMICSEL_FIELD(6U)
#define STM32_TIMICSEL_HSI256_MSIK1024_MSIK4    STM32_TIMICSEL_FIELD(7U)
/** @} */

/**
 * @name    RCC_CCIPR2 register bits definitions
 * @{
 */

#define STM32_ADF1SEL_POS       0
#define STM32_ADF1SEL_MASK      (3U << STM32_ADF1SEL_POS)
#define STM32_ADF1SEL_FIELD(n)  ((n) << STM32_ADF1SEL_POS)
#define STM32_ADF1SEL_HCLK      STM32_ADF1SEL_FIELD(0U)
#define STM32_ADF1SEL_AUDIOCLK  STM32_ADF1SEL_FIELD(1U)
#define STM32_ADF1SEL_HSE       STM32_ADF1SEL_FIELD(2U)

#define STM32_SPI3SEL_POS       3
#define STM32_SPI3SEL_MASK      (1U << STM32_SPI3SEL_POS)
#define STM32_SPI3SEL_FIELD(n)  ((n) << STM32_SPI3SEL_POS)
#define STM32_SPI3SEL_PCLK1     STM32_SPI3SEL_FIELD(0U)
#define STM32_SPI3SEL_MSIK      STM32_SPI3SEL_FIELD(1U)

#define STM32_SAI1SEL_POS       5
#define STM32_SAI1SEL_MASK      (3U << STM32_SAI1SEL_POS)
#define STM32_SAI1SEL_FIELD(n)  ((n) << STM32_SAI1SEL_POS)
#define STM32_SAI1SEL_MSIK      STM32_SAI1SEL_FIELD(0U)
#define STM32_SAI1SEL_AUDIOCLK  STM32_SAI1SEL_FIELD(1U)
#define STM32_SAI1SEL_HSE       STM32_SAI1SEL_FIELD(2U)

#define STM32_RNGSEL_POS        11
#define STM32_RNGSEL_MASK       (1U << STM32_RNGSEL_POS)
#define STM32_RNGSEL_FIELD(n)   ((n) << STM32_RNGSEL_POS)
#define STM32_RNGSEL_IGNORE     0xFFFFFFFFU
#define STM32_RNGSEL_HSI48      STM32_RNGSEL_FIELD(0U)
#define STM32_RNGSEL_MSIK       STM32_RNGSEL_FIELD(1U)

#define STM32_ADCDACPRE_POS     12
#define STM32_ADCDACPRE_MASK    (15U << STM32_ADCDACPRE_POS)
#define STM32_ADCDACPRE_FIELD(n) ((n) << STM32_ADCDACPRE_POS)
#define STM32_ADCDACPRE_ICLK        STM32_ADCDACPRE_FIELD(0U)
#define STM32_ADCDACPRE_ICLKDIV2    STM32_ADCDACPRE_FIELD(1U)
#define STM32_ADCDACPRE_ICLKDIV4    STM32_ADCDACPRE_FIELD(8U)
#define STM32_ADCDACPRE_ICLKDIV8    STM32_ADCDACPRE_FIELD(9U)
#define STM32_ADCDACPRE_ICLKDIV16   STM32_ADCDACPRE_FIELD(10U)
#define STM32_ADCDACPRE_ICLKDIV32   STM32_ADCDACPRE_FIELD(11U)
#define STM32_ADCDACPRE_ICLKDIV64   STM32_ADCDACPRE_FIELD(12U)
#define STM32_ADCDACPRE_ICLKDIV128  STM32_ADCDACPRE_FIELD(13U)
#define STM32_ADCDACPRE_ICLKDIV256  STM32_ADCDACPRE_FIELD(14U)
#define STM32_ADCDACPRE_ICLKDIV512  STM32_ADCDACPRE_FIELD(15U)

#define STM32_ADCDACSEL_POS     16
#define STM32_ADCDACSEL_MASK    (3U << STM32_ADCDACSEL_POS)
#define STM32_ADCDACSEL_FIELD(n) ((n) << STM32_ADCDACSEL_POS)
#define STM32_ADCDACSEL_HCLK    STM32_ADCDACSEL_FIELD(0U)
#define STM32_ADCDACSEL_HSE     STM32_ADCDACSEL_FIELD(1U)
#define STM32_ADCDACSEL_MSIK    STM32_ADCDACSEL_FIELD(2U)

#define STM32_DAC1SHSEL_POS     19
#define STM32_DAC1SHSEL_MASK    (1U << STM32_DAC1SHSEL_POS)
#define STM32_DAC1SHSEL_FIELD(n) ((n) << STM32_DAC1SHSEL_POS)
#define STM32_DAC1SHSEL_IGNORE  0xFFFFFFFFU
#define STM32_DAC1SHSEL_LSE     STM32_DAC1SHSEL_FIELD(0U)
#define STM32_DAC1SHSEL_LSI     STM32_DAC1SHSEL_FIELD(1U)

