ChibiOS/ChibiOS/os/hal/ports/STM32/STM32U3xx/hal_lld.h
  #if STM32_MSIRC0_MODE == STM32_MSIRC0_PLL_LSE
    #error "LSE not enabled, required by STM32_MSIRC0_MODE"
  #endif

  #if STM32_MSIRC0_MODE == STM32_MSIRC0_PLL_LSE_FAST
    #error "LSE not enabled, required by STM32_MSIRC1_MODE"
  #endif

  #if STM32_MSIRC1_MODE == STM32_MSIRC1_PLL_LSE
    #error "LSE not enabled, required by STM32_MSIRC1_MODE"
  #endif

  #if STM32_MSIRC1_MODE == STM32_MSIRC1_PLL_LSE_FAST
    #error "LSE not enabled, required by STM32_MSIRC1_MODE"
  #endif

  #if STM32_MCO1SEL == STM32_MCO1SEL_LSE
    #error "LSE not enabled, required by STM32_MCO1SEL"
  #endif

  #if STM32_MCO2SEL == STM32_MCO2SEL_LSE
    #error "LSE not enabled, required by STM32_MCO1SEL"
  #endif

  #if (STM32_LPUART1SEL == STM32_LPUART1SEL_LSE)
    #error "LSE not enabled, required by STM32_LPUART1SEL"
  #endif

  #if (STM32_LPTIM1SEL == STM32_LPTIM1SEL_LSE)
    #error "LSE not enabled, required by STM32_LPTIM1SEL"
  #endif
  #if (STM32_LPTIM2SEL == STM32_LPTIM2SEL_LSE)
    #error "LSE not enabled, required by STM32_LPTIM2SEL"
  #endif
  #if (STM32_LPTIM34SEL == STM32_LPTIM34SEL_LSE)
    #error "LSE not enabled, required by STM32_LPTIM34SEL"
  #endif

  #if STM32_SYSTICKSEL == STM32_SYSTICKSEL_LSE
    #error "LSE not enabled, required by STM32_SYSTICKSEL"
  #endif

  #if STM32_DAC1SHSEL == STM32_DAC1SHSEL_LSE
    #error "LSE not enabled, required by STM32_DACSELSH"
  #endif

  #if STM32_RTCSEL == STM32_RTCSEL_LSE
    #error "LSE not enabled, required by STM32_RTCSEL"
  #endif

  #if STM32_LSCOSEL == STM32_LSCOSEL_LSE
    #error "LSE not enabled, required by STM32_LSCOSEL"
  #endif

#endif /* !STM32_LSE_ENABLED */

/*
 * HSE related checks.
 */
#if STM32_HSE_ENABLED
#else /* !STM32_HSE_ENABLED */

  #if STM32_MSIRC0_MODE == STM32_MSIRC0_PLL_HSE
    #error "HSE not enabled, required by STM32_MSIRC0_MODE"
  #endif

  #if STM32_MSIRC1_MODE == STM32_MSIRC1_PLL_HSE
    #error "HSE not enabled, required by STM32_MSIRC1_MODE"
  #endif

  #if STM32_MSIRC0_MODE == STM32_MSIRC0_PLL_HSE_FAST
    #error "HSE not enabled, required by STM32_MSIRC0_MODE"
  #endif

  #if STM32_MSIRC1_MODE == STM32_MSIRC1_PLL_HSE_FAST
    #error "HSE not enabled, required by STM32_MSIRC1_MODE"
  #endif

  #if STM32_SW == STM32_SW_HSE
    #error "HSE not enabled, required by STM32_SW"
  #endif

  #if STM32_MCO1SEL == STM32_MCO1SEL_HSE
    #error "HSE not enabled, required by STM32_MCO1SEL"
  #endif

  #if STM32_MCO2SEL == STM32_MCO2SEL_HSE
    #error "HSE not enabled, required by STM32_MCO2SEL"
  #endif

  #if STM32_ADCDACSEL == STM32_ADCDACSEL_HSE
    #error "HSE not enabled, required by STM32_ADCDACSEL"
  #endif

  #if STM32_SAI1SEL == STM32_SAI1SEL_HSE
    #error "HSE not enabled, required by STM32_SAI1SEL"
  #endif

  #if STM32_RTCSEL == STM32_RTCSEL_HSEDIV
    #error "HSE not enabled, required by STM32_RTCSEL"
  #endif

  #if STM32_ICLKSEL == STM32_ICLKSEL_HSE
    #error "HSE not enabled, required by STM32_ICLKSEL"
  #endif

#endif /* !STM32_HSE_ENABLED */

/**
 * @brief   PLL input divider selection based on HSE frequency.
 */
#if (STM32_MSIRC0_MODE == STM32_MSIRC0_PLL_HSE) ||                          \
    (STM32_MSIRC1_MODE == STM32_MSIRC1_PLL_HSE) || defined(__DOXYGEN__)
  #if STM32_HSECLK == 32000000 || defined(__DOXYGEN__)
    #define STM32_MSIHSINDIV        STM32_MSIHSINDIV_HSE32
  #elif STM32_HSECLK == 16000000
    #define STM32_MSIHSINDIV        STM32_MSIHSINDIV_HSE16
  #else
    #error "MSIPLL feature requires a 16 or 32 MHz HSE clock"
  #endif

#else
  #define STM32_MSIHSINDIV          0U
#endif

/**
 * @brief   MSIRC0 mode selection.
 */
#if (STM32_MSIRC0_MODE == STM32_MSIRC0_FREE) || defined(__DOXYGEN__)
  #define STM32_MSIPLL0EN           0U
  #define STM32_MSIPLL0SEL          0U
  #define STM32_MSIPLL0FAST         0U

#elif STM32_MSIRC0_MODE == STM32_MSIRC0_PLL_LSE
  #define STM32_MSIPLL0EN           RCC_CR_MSIPLL0EN
  #define STM32_MSIPLL0SEL          STM32_MSIPLL0SEL_LSE
  #define STM32_MSIPLL0FAST         0U

#elif STM32_MSIRC0_MODE == STM32_MSIRC0_PLL_HSE
  #define STM32_MSIPLL0EN           RCC_CR_MSIPLL0EN
  #define STM32_MSIPLL0SEL          STM32_MSIPLL0SEL_HSE
  #define STM32_MSIPLL0FAST         0U

#elif STM32_MSIRC0_MODE == STM32_MSIRC0_PLL_LSE_FAST
  #define STM32_MSIPLL0EN           RCC_CR_MSIPLL0EN
  #define STM32_MSIPLL0SEL          STM32_MSIPLL0SEL_LSE
  #define STM32_MSIPLL0FAST         RCC_CR_MSIPLL0FAST

#elif STM32_MSIRC0_MODE == STM32_MSIRC0_PLL_HSE_FAST
  #define STM32_MSIPLL0EN           RCC_CR_MSIPLL0EN
  #define STM32_MSIPLL0SEL          STM32_MSIPLL0SEL_HSE
  #define STM32_MSIPLL0FAST         RCC_CR_MSIPLL0FAST

#else
  #error "invalid STM32_MSIRC0_MODE value specified"
#endif

/**
 * @brief   MSIRC1 mode selection.
 */
#if (STM32_MSIRC1_MODE == STM32_MSIRC1_FREE) || defined(__DOXYGEN__)
  #define STM32_MSIPLL1EN           0U
  #define STM32_MSIPLL1SEL          0U
  #define STM32_MSIPLL1FAST         0U

#elif STM32_MSIRC1_MODE == STM32_MSIRC1_PLL_LSE
  #define STM32_MSIPLL1EN           RCC_CR_MSIPLL1EN
  #define STM32_MSIPLL1SEL          STM32_MSIPLL1SEL_LSE
  #define STM32_MSIPLL1FAST         0U

#elif STM32_MSIRC1_MODE == STM32_MSIRC1_PLL_HSE
  #define STM32_MSIPLL1EN           RCC_CR_MSIPLL1EN
  #define STM32_MSIPLL1SEL          STM32_MSIPLL1SEL_HSE
  #define STM32_MSIPLL1FAST         0U

#elif STM32_MSIRC1_MODE == STM32_MSIRC1_PLL_LSE
  #define STM32_MSIPLL1EN           RCC_CR_MSIPLL1EN
  #define STM32_MSIPLL1SEL          STM32_MSIPLL1SEL_LSE
  #define STM32_MSIPLL1FAST         RCC_CR_MSIPLL1FAST

#elif STM32_MSIRC1_MODE == STM32_MSIRC1_PLL_HSE
  #define STM32_MSIPLL1EN           RCC_CR_MSIPLL1EN
  #define STM32_MSIPLL1SEL          STM32_MSIPLL1SEL_HSE
  #define STM32_MSIPLL1FAST         RCC_CR_MSIPLL1FAST

#else
  #error "invalid STM32_MSIRC1_MODE value specified"
#endif

#if (STM32_MSIPLL0EN == 0) || defined(__DOXYGEN__)
  /**
   * @brief   MSIPLL1N field initializer.
   */
  #define STM32_MSIPLL1N            0U

  /**
   * @brief   MSIRC0 base frequency.
   */
  #define STM32_MSIRC0CLK           96000000U

  /**
   * @brief   MSIRC1 base frequency.
   */
  #define STM32_MSIRC1CLK           24000000U

#else /* PLL mode enabled.*/
  #if STM32_MSIPLL1N_VALUE == 0
    #define STM32_MSIPLL1N          0U
    #if STM32_MSIPLL1SEL == 0
      #define STM32_MSIRC0CLK       96010000U
      #define STM32_MSIRC1CLK       23986000U
    #else
      #define STM32_MSIRC0CLK       96000000U
      #define STM32_MSIRC1CLK       24016000U
    #endif

  #elif STM32_MSIPLL1N_VALUE == 2
    #define STM32_MSIPLL1N          (RCC_ICSCR1_MSIPLL1N_1)
    #if STM32_MSIPLL1SEL == 0
      #define STM32_MSIRC0CLK       96010000U
      #define STM32_MSIRC1CLK       22577000U
    #else
      #define STM32_MSIRC0CLK       96000000U
      #define STM32_MSIRC1CLK       22581000U
    #endif

  #elif STM32_MSIPLL1N_VALUE == 3
    #define STM32_MSIPLL1N          (RCC_ICSCR1_MSIPLL1N_1 | RCC_ICSCR1_MSIPLL1N_0)
    #if STM32_MSIPLL1SEL == 0
      #define STM32_MSIRC0CLK       96010000U
      #define STM32_MSIRC1CLK       24576000U
    #else
      #define STM32_MSIRC0CLK       96000000U
      #define STM32_MSIRC1CLK       24577000U
    #endif

  #else
    #error "invalid STM32_MSIPLL1N_VALUE value specified"
  #endif
#endif

/**
 * @brief   MSIS clock frequency.
 */
#if (STM32_MSIS_SRCDIV == STM32_MSIS_IRC0_DIV1) || defined(__DOXYGEN__)
  #define STM32_MSISIRC0_ENABLED    TRUE
  #define STM32_MSISIRC1_ENABLED    FALSE
  #define STM32_MSISDIV             STM32_MSISDIV_FIELD(0U)
  #define STM32_MSISSEL             STM32_MSISSEL_MSIRC0
  #define STM32_MSISCLK             STM32_MSIRC0CLK

#elif STM32_MSIS_SRCDIV == STM32_MSIS_IRC0_DIV2
  #define STM32_MSISIRC0_ENABLED    TRUE
  #define STM32_MSISIRC1_ENABLED    FALSE
  #define STM32_MSISDIV             STM32_MSISDIV_FIELD(1U)
  #define STM32_MSISSEL             STM32_MSISSEL_MSIRC0
  #define STM32_MSISCLK             (STM32_MSIRC0CLK / 2U)

#elif STM32_MSIS_SRCDIV == STM32_MSIS_IRC0_DIV4
  #define STM32_MSISIRC0_ENABLED    TRUE
  #define STM32_MSISIRC1_ENABLED    FALSE
  #define STM32_MSISDIV             STM32_MSISDIV_FIELD(2U)
  #define STM32_MSISSEL             STM32_MSISSEL_MSIRC0
  #define STM32_MSISCLK             (STM32_MSIRC0CLK / 4U)

#elif STM32_MSIS_SRCDIV == STM32_MSIS_IRC0_DIV8
  #define STM32_MSISIRC0_ENABLED    TRUE
  #define STM32_MSISIRC1_ENABLED    FALSE
  #define STM32_MSISDIV             STM32_MSISDIV_FIELD(3U)
  #define STM32_MSISSEL             STM32_MSISSEL_MSIRC0
  #define STM32_MSISCLK             (STM32_MSIRC0CLK / 8U)

