ChibiOS/ChibiOS/os/hal/ports/STM32/STM32U3xx/hal_lld.h
#elif STM32_MSIS_SRCDIV == STM32_MSIS_IRC1_DIV1
  #define STM32_MSISIRC0_ENABLED    FALSE
  #define STM32_MSISIRC1_ENABLED    TRUE
  #define STM32_MSISDIV             STM32_MSISDIV_FIELD(0U)
  #define STM32_MSISSEL             STM32_MSISSEL_MSIRC1
  #define STM32_MSISCLK             STM32_MSIRC1CLK

#elif STM32_MSIS_SRCDIV == STM32_MSIS_IRC1_DIV2
  #define STM32_MSISIRC0_ENABLED    FALSE
  #define STM32_MSISIRC1_ENABLED    TRUE
  #define STM32_MSISDIV             STM32_MSISDIV_FIELD(1U)
  #define STM32_MSISSEL             STM32_MSISSEL_MSIRC1
  #define STM32_MSISCLK             (STM32_MSIRC1CLK / 2U)

#elif STM32_MSIS_SRCDIV == STM32_MSIS_IRC1_DIV4
  #define STM32_MSISIRC0_ENABLED    FALSE
  #define STM32_MSISIRC1_ENABLED    TRUE
  #define STM32_MSISDIV             STM32_MSISDIV_FIELD(2U)
  #define STM32_MSISSEL             STM32_MSISSEL_MSIRC1
  #define STM32_MSISCLK             (STM32_MSIRC1CLK / 4U)

#elif STM32_MSIS_SRCDIV == STM32_MSIS_IRC1_DIV8
  #define STM32_MSISIRC0_ENABLED    FALSE
  #define STM32_MSISIRC1_ENABLED    TRUE
  #define STM32_MSISDIV             STM32_MSISDIV_FIELD(3U)
  #define STM32_MSISSEL             STM32_MSISSEL_MSIRC1
  #define STM32_MSISCLK             (STM32_MSIRC1CLK / 8U)

#else
  #error "invalid STM32_MSIS_SRCDIV value specified"
#endif

/**
 * @brief   MSIK clock frequency.
 */
#if (STM32_MSIK_SRCDIV == STM32_MSIK_IRC0_DIV1) || defined(__DOXYGEN__)
  #define STM32_MSIKIRC0_ENABLED    TRUE
  #define STM32_MSIKIRC1_ENABLED    FALSE
  #define STM32_MSIKDIV             STM32_MSIKDIV_FIELD(0U)
  #define STM32_MSIKSEL             STM32_MSIKSEL_MSIRC0
  #define STM32_MSIKCLK             STM32_MSIRC0CLK

#elif STM32_MSIK_SRCDIV == STM32_MSIK_IRC0_DIV2
  #define STM32_MSIKIRC0_ENABLED    TRUE
  #define STM32_MSIKIRC1_ENABLED    FALSE
  #define STM32_MSIKDIV             STM32_MSIKDIV_FIELD(1U)
  #define STM32_MSIKSEL             STM32_MSIKSEL_MSIRC0
  #define STM32_MSIKCLK             (STM32_MSIRC0CLK / 2U)

#elif STM32_MSIK_SRCDIV == STM32_MSIK_IRC0_DIV4
  #define STM32_MSIKIRC0_ENABLED    TRUE
  #define STM32_MSIKIRC1_ENABLED    FALSE
  #define STM32_MSIKDIV             STM32_MSIKDIV_FIELD(2U)
  #define STM32_MSIKSEL             STM32_MSIKSEL_MSIRC0
  #define STM32_MSIKCLK             (STM32_MSIRC0CLK / 4U)

#elif STM32_MSIK_SRCDIV == STM32_MSIK_IRC0_DIV8
  #define STM32_MSIKIRC0_ENABLED    TRUE
  #define STM32_MSIKIRC1_ENABLED    FALSE
  #define STM32_MSIKDIV             STM32_MSIKDIV_FIELD(3U)
  #define STM32_MSIKSEL             STM32_MSIKSEL_MSIRC0
  #define STM32_MSIKCLK             (STM32_MSIRC0CLK / 8U)

#elif STM32_MSIK_SRCDIV == STM32_MSIK_IRC1_DIV1
  #define STM32_MSIKIRC0_ENABLED    FALSE
  #define STM32_MSIKIRC1_ENABLED    TRUE
  #define STM32_MSIKDIV             STM32_MSIKDIV_FIELD(0U)
  #define STM32_MSIKSEL             STM32_MSIKSEL_MSIRC1
  #define STM32_MSIKCLK             STM32_MSIRC1CLK

#elif STM32_MSIK_SRCDIV == STM32_MSIK_IRC1_DIV2
  #define STM32_MSIKIRC0_ENABLED    FALSE
  #define STM32_MSIKIRC1_ENABLED    TRUE
  #define STM32_MSIKDIV             STM32_MSIKDIV_FIELD(1U)
  #define STM32_MSIKSEL             STM32_MSIKSEL_MSIRC1
  #define STM32_MSIKCLK             (STM32_MSIRC1CLK / 2U)

#elif STM32_MSIK_SRCDIV == STM32_MSIK_IRC1_DIV4
  #define STM32_MSIKIRC0_ENABLED    FALSE
  #define STM32_MSIKIRC1_ENABLED    TRUE
  #define STM32_MSIKDIV             STM32_MSIKDIV_FIELD(2U)
  #define STM32_MSIKSEL             STM32_MSIKSEL_MSIRC1
  #define STM32_MSIKCLK             (STM32_MSIRC1CLK / 4U)

#elif STM32_MSIK_SRCDIV == STM32_MSIK_IRC1_DIV8
  #define STM32_MSIKIRC0_ENABLED    FALSE
  #define STM32_MSIKIRC1_ENABLED    TRUE
  #define STM32_MSIKDIV             STM32_MSIKDIV_FIELD(3U)
  #define STM32_MSIKSEL             STM32_MSIKSEL_MSIRC1
  #define STM32_MSIKCLK             (STM32_MSIRC1CLK / 8U)

#else
  #error "invalid STM32_MSIK_SRCDIV value specified"
#endif

/* PLL enabling checks, PLL cannot be enabled if the associated oscillator
   is not active.*/
#if (STM32_MSIPLL0EN > 0) && !STM32_MSISIRC0_ENABLED && !STM32_MSIKIRC0_ENABLED
#error "STM32_MSIRC0_MODE requires PLL but MSIIRC0 is not used"
#endif
#if (STM32_MSIPLL1EN > 0) && !STM32_MSISIRC1_ENABLED && !STM32_MSIKIRC1_ENABLED
#error "STM32_MSIRC1_MODE requires PLL but MSIIRC1 is not used"
#endif

/**
 * @brief   System clock source.
 */
#if (STM32_SW == STM32_SW_MSIS) || defined(__DOXYGEN__)
  #define STM32_SYSCLK              STM32_MSISCLK

#elif STM32_SW == STM32_SW_HSI16
  #define STM32_SYSCLK              STM32_HSI16CLK

#elif STM32_SW == STM32_SW_HSE
  #define STM32_SYSCLK              STM32_HSECLK

#else
  #error "invalid STM32_SW value specified"
#endif

/* EPOD boost-related settings.*/
#if STM32_SYSCLK > STM32_BOOSTEN_THRESHOLD
  #if STM32_SW == STM32_SW_MSIS
    #define STM32_BOOSTER_ENABLED   TRUE
    #define STM32_BOOSTSEL          STM32_BOOSTSEL_MSIS
    #define STM32_BOOSTDIV          0U

  #elif STM32_SW == STM32_SW_HSI16
    #define STM32_BOOSTER_ENABLED   TRUE
    #define STM32_BOOSTSEL          STM32_BOOSTSEL_HSI16
    #define STM32_BOOSTDIV          STM32_BOOSTDIV_DIV2

  #else /* STM32_SW == STM32_SW_HSE */
    #define STM32_BOOSTER_ENABLED   TRUE
    #define STM32_BOOSTSEL          STM32_BOOSTSEL_HSE
    /* The divider is a function of the HSE frequency.*/
    #if STM32_HSECLK <= 12000000U
      #define STM32_BOOSTDIV        STM32_BOOSTDIV_DIV1
    #elif STM32_HSECLK <= 24000000U
      #define STM32_BOOSTDIV        STM32_BOOSTDIV_DIV2
    #else
      #define STM32_BOOSTDIV        STM32_BOOSTDIV_DIV4
    #endif
  #endif
#else /* EPOD boost not required.*/
  #define STM32_BOOSTER_ENABLED     FALSE
  #define STM32_BOOSTSEL            0U
  #define STM32_BOOSTDIV            0U
#endif

/* Bus handlers.*/
#include "stm32_ahb.inc"
#include "stm32_apb1.inc"
#include "stm32_apb2.inc"
#include "stm32_apb3.inc"

/* STOPWUCK setting check.*/
#if (STM32_STOPWUCK == STM32_STOPWUCK_MSIS) || defined(__DOXYGEN__)

#elif STM32_STOPWUCK == STM32_STOPWUCK_HSI16

#else
  #error "invalid STM32_STOPWUCK value specified"
#endif

/* STOPKERWUCK setting check.*/
#if (STM32_STOPKERWUCK == STM32_STOPKERWUCK_MSIK) || defined(__DOXYGEN__)

