ChibiOS/ChibiOS/os/hal/ports/STM32/STM32U3xx/hal_lld.h
#elif STM32_STOPKERWUCK == STM32_STOPKERWUCK_HSI16

#else
  #error "invalid STM32_STOPKERWUCK value specified"
#endif

/* STM32_MSIBIASL setting check.*/
#if (STM32_MSIBIAS == STM32_MSIBIAS_CONTINUOUS) || defined(__DOXYGEN__)

#elif STM32_MSIBIAS == STM32_MSIBIAS_SAMPLING

#else
  #error "invalid STM32_MSIBIAS value specified"
#endif

/**
 * @brief   MCO1 source clock.
 */
#if (STM32_MCO1SEL == STM32_MCO1SEL_OFF) || defined(__DOXYGEN__)
  #define STM32_MCO1DIVCLK          0U

#elif STM32_MCO1SEL == STM32_MCO1SEL_SYSCLK
  #define STM32_MCO1DIVCLK          STM32_SYSCLK

#elif STM32_MCO1SEL == STM32_MCO1SEL_MSIS
  #define STM32_MCO1DIVCLK          STM32_MSISCLK

#elif STM32_MCO1SEL == STM32_MCO1SEL_HSI16
  #define STM32_MCO1DIVCLK          STM32_HSI16CLK

#elif STM32_MCO1SEL == STM32_MCO1SEL_HSE
  #define STM32_MCO1DIVCLK          STM32_HSE

#elif STM32_MCO1SEL == STM32_MCO1SEL_LSI
  #define STM32_MCO1DIVCLK          STM32_LSICLK

#elif STM32_MCO1SEL == STM32_MCO1SEL_LSE
  #define STM32_MCO1DIVCLK          STM32_LSECLK

#elif STM32_MCO1SEL == STM32_MCO1SEL_HSI48
  #define STM32_MCO1DIVCLK          STM32_HSI48CLK

#elif STM32_MCO1SEL == STM32_MCO1SEL_MSIK
  #define STM32_MCO1DIVCLK          STM32_MSIKCLK

#else
  #error "invalid STM32_MCO1SEL value specified"
#endif

/**
 * @brief   MCO1PRE field.
 */
#if (STM32_MCO1PRE_VALUE == 1) || defined(__DOXYGEN__)
  #define STM32_MCO1PRE             STM32_MCO1PRE_DIV1
#elif STM32_MCO1PRE_VALUE == 2
  #define STM32_MCO1PRE             STM32_MCO1PRE_DIV2
#elif STM32_MCO1PRE_VALUE == 4
  #define STM32_MCO1PRE             STM32_MCO1PRE_DIV4
#elif STM32_MCO1PRE_VALUE == 8
  #define STM32_MCO1PRE             STM32_MCO1PRE_DIV8
#elif STM32_MCO1PRE_VALUE == 16
  #define STM32_MCO1PRE             STM32_MCO1PRE_DIV16
#elif STM32_MCO1PRE_VALUE == 32
  #define STM32_MCO1PRE             STM32_MCO1PRE_DIV32
#elif STM32_MCO1PRE_VALUE == 64
  #define STM32_MCO1PRE             STM32_MCO1PRE_DIV64
#elif STM32_MCO1PRE_VALUE == 128
  #define STM32_MCO1PRE             STM32_MCO1PRE_DIV128

#else
#error "invalid STM32_MCO1PRE_VALUE value specified"
#endif

/**
 * @brief   MCO2 source clock.
 */
#if (STM32_MCO2SEL == STM32_MCO2SEL_OFF) || defined(__DOXYGEN__)
  #define STM32_MCO2DIVCLK          0U

#elif STM32_MCO2SEL == STM32_MCO2SEL_SYSCLK
  #define STM32_MCO2DIVCLK          STM32_SYSCLK

#elif STM32_MCO2SEL == STM32_MCO2SEL_MSIS
  #define STM32_MCO2DIVCLK          STM32_MSISCLK

#elif STM32_MCO2SEL == STM32_MCO2SEL_HSI16
  #define STM32_MCO2DIVCLK          STM32_HSI16CLK

#elif STM32_MCO2SEL == STM32_MCO2SEL_HSE
  #define STM32_MCO2DIVCLK          STM32_HSE

#elif STM32_MCO2SEL == STM32_MCO2SEL_LSI
  #define STM32_MCO2DIVCLK          STM32_LSICLK

#elif STM32_MCO2SEL == STM32_MCO2SEL_LSE
  #define STM32_MCO2DIVCLK          STM32_LSECLK

#elif STM32_MCO2SEL == STM32_MCO2SEL_HSI48
  #define STM32_MCO2DIVCLK          STM32_HSI48CLK

#elif STM32_MCO2SEL == STM32_MCO2SEL_MSIK
  #define STM32_MCO2DIVCLK          STM32_MSIKCLK

#else
  #error "invalid STM32_MCO2SEL value specified"
#endif

/**
 * @brief   MCO2PRE field.
 */
#if (STM32_MCO2PRE_VALUE == 1) || defined(__DOXYGEN__)
  #define STM32_MCO2PRE             STM32_MCO2PRE_DIV1
#elif STM32_MCO2PRE_VALUE == 2
  #define STM32_MCO2PRE             STM32_MCO2PRE_DIV2
#elif STM32_MCO2PRE_VALUE == 4
  #define STM32_MCO2PRE             STM32_MCO2PRE_DIV4
#elif STM32_MCO2PRE_VALUE == 8
  #define STM32_MCO2PRE             STM32_MCO2PRE_DIV8
#elif STM32_MCO2PRE_VALUE == 16
  #define STM32_MCO2PRE             STM32_MCO2PRE_DIV16
#elif STM32_MCO2PRE_VALUE == 32
  #define STM32_MCO2PRE             STM32_MCO2PRE_DIV32
#elif STM32_MCO2PRE_VALUE == 64
  #define STM32_MCO2PRE             STM32_MCO2PRE_DIV64
#elif STM32_MCO2PRE_VALUE == 128
  #define STM32_MCO2PRE             STM32_MCO2PRE_DIV128

#else
#error "invalid STM32_MCO2PRE_VALUE value specified"
#endif

/**
 * @brief   MCO1 output pin clock frequency.
 */
#define STM32_MCO1CLK               (STM32_MCO1DIVCLK / STM32_MCO1PRE_VALUE)

/**
 * @brief   MCO2 output pin clock frequency.
 */
#define STM32_MCO2CLK               (STM32_MCO2DIVCLK / STM32_MCO2PRE_VALUE)

/**
 * @brief   RTC clock frequency.
 */
#if (STM32_RTCSEL == STM32_RTCSEL_NOCLOCK) || defined(__DOXYGEN__)
  #define STM32_RTCCLK              0U

#elif STM32_RTCSEL == STM32_RTCSEL_LSE
  #define STM32_RTCCLK              STM32_LSECLK

#elif STM32_RTCSEL == STM32_RTCSEL_LSI
  #define STM32_RTCCLK              STM32_LSICLK

#elif STM32_RTCSEL == STM32_RTCSEL_HSEDIV
  #define STM32_RTCCLK              (STM32_HSECLK / 32U)

#else
  #error "invalid STM32_RTCSEL value specified"
#endif

/**
 * @brief   LSCO clock frequency.
 */
#if (STM32_LSCOSEL == STM32_LSCOSEL_NOCLOCK) || defined(__DOXYGEN__)
  #define STM32_LSCOCLK             0U

#elif STM32_LSCOSEL == STM32_LSCOSEL_LSI
  #define STM32_LSCOCLK             STM32_LSICLK

#elif STM32_LSCOSEL == STM32_LSCOSEL_LSE
  #define STM32_LSCOCLK             STM32_LSECLK

#else
  #error "invalid STM32_LSCOSEL value specified"
#endif

/**
 * @brief   USART1 clock frequency.
 */
#if (STM32_USART1SEL == STM32_USART1SEL_PCLK2) || defined(__DOXYGEN__)
  #define STM32_USART1CLK           hal_lld_get_clock_point(CLK_PCLK2)

#elif STM32_USART1SEL == STM32_USART1SEL_MSIK
  #define STM32_USART1CLK           hal_lld_get_clock_point(CLK_MSIK)

#else
  #error "invalid source selected for USART1 clock"
#endif

/**
 * @brief   USART3 clock frequency.
 */
#if (STM32_USART3SEL == STM32_USART3SEL_PCLK1) || defined(__DOXYGEN__)
  #define STM32_USART3CLK           hal_lld_get_clock_point(CLK_PCLK1)

#elif STM32_USART3SEL == STM32_USART3SEL_MSIK
  #define STM32_USART3CLK           hal_lld_get_clock_point(CLK_MSIK)

#else
  #error "invalid source selected for USART3 clock"
#endif

/**
 * @brief   UART4 clock frequency.
 */
#if (STM32_UART4SEL == STM32_UART4SEL_PCLK1) || defined(__DOXYGEN__)
  #define STM32_UART4CLK            hal_lld_get_clock_point(CLK_PCLK1)

#elif STM32_UART4SEL == STM32_UART4SEL_MSIK
  #define STM32_UART4CLK            hal_lld_get_clock_point(CLK_MSIK)

#else
  #error "invalid source selected for UART4 clock"
#endif

/**
 * @brief   UART5 clock frequency.
 */
#if (STM32_UART5SEL == STM32_UART5SEL_PCLK1) || defined(__DOXYGEN__)
  #define STM32_UART5CLK            hal_lld_get_clock_point(CLK_PCLK1)

#elif STM32_UART5SEL == STM32_UART5SEL_MSIK
  #define STM32_UART5CLK            hal_lld_get_clock_point(CLK_MSIK)

#else
  #error "invalid source selected for UART5 clock"
#endif

/**
 * @brief   LPUART1 clock frequency.
 */
#if (STM32_LPUART1SEL == STM32_LPUART1SEL_PCLK3) || defined(__DOXYGEN__)
  #define STM32_LPUART1CLK          hal_lld_get_clock_point(CLK_PCLK3)

#elif STM32_LPUART1SEL == STM32_LPUART1SEL_MSIK
  #define STM32_LPUART1CLK          hal_lld_get_clock_point(CLK_MSIK)

#elif STM32_LPUART1SEL == STM32_LPUART1SEL_HSI16
  #define STM32_LPUART1CLK          STM32_HSI16CLK

