ChibiOS/ChibiOS/os/hal/ports/STM32/STM32U3xx/hal_lld.h
#elif STM32_LPUART1SEL == STM32_LPUART1SEL_LSE
  #define STM32_LPUART1CLK          STM32_LSECLK

#else
  #error "invalid source selected for LPUART1 clock"
#endif

#if (STM32_TIMICSEL == STM32_TIMICSEL_NOCLOCK) || defined(__DOXYGEN__)
  /**
   * @brief   TIM16 internal capture clock frequency.
   */
  #define STM32_TIM16CCLK           0U
  /**
   * @brief   TIM17 internal capture clock frequency.
   */
  #define STM32_TIM17CCLK           0U
  /**
   * @brief   LPTIM2 internal capture clock frequency.
   */
  #define STM32_LPTIM2CCLK          0U

#elif STM32_TIMICSEL == STM32_TIMICSEL_HSI256_MSIS1024_MSIS4
  #define STM32_TIM16CCLK           (STM32_HSI16CLK / 256U)
  #define STM32_TIM15CCLK           (STM32_MSISCLK / 1024U)
  #define STM32_LPTIM2CCLK          (STM32_MSISCLK / 4U)

#elif STM32_TIMICSEL == STM32_TIMICSEL_HSI256_MSIS1024_MSIK4
  #define STM32_TIM16CCLK           (STM32_HSI16CLK / 256U)
  #define STM32_TIM15CCLK           (STM32_MSISCLK / 1024U)
  #define STM32_LPTIM2CCLK          (STM32_MSIKCLK / 4U)

#elif STM32_TIMICSEL == STM32_TIMICSEL_HSI256_MSIK1024_MSIS4
  #define STM32_TIM16CCLK           (STM32_HSI16CLK / 256U)
  #define STM32_TIM15CCLK           (STM32_MSIKCLK / 1024U)
  #define STM32_LPTIM2CCLK          (STM32_MSISCLK / 4U)

#elif STM32_TIMICSEL == STM32_TIMICSEL_HSI256_MSIK1024_MSIK4
  #define STM32_TIM16CCLK           (STM32_HSI16CLK / 256U)
  #define STM32_TIM15CCLK           (STM32_MSIKCLK / 1024U)
  #define STM32_LPTIM2CCLK          (STM32_MSIKCLK / 4U)

#else
  #error "invalid source selected for TIMICSEL clock"
#endif

/**
 * @brief   LPTIM1 clock frequency.
 */
#if (STM32_LPTIM1SEL == STM32_LPTIM1SEL_MSIK) || defined(__DOXYGEN__)
  #define STM32_LPTIM1CLK           hal_lld_get_clock_point(CLK_MSIK)

#elif STM32_LPTIM1SEL == STM32_LPTIM1SEL_LSI
  #define STM32_LPUART1CLK          STM32_LSICLK

#elif STM32_LPTIM1SEL == STM32_LPTIM1SEL_PLL3R
  #define STM32_LPUART1CLK          STM32_HSI16CLK

#elif STM32_LPTIM1SEL == STM32_LPTIM1SEL_LSE
  #define STM32_LPTIM1CLK           STM32_LSECLK

#else
  #error "invalid source selected for LPTIM1 clock"
#endif

/**
 * @brief   LPTIM2 clock frequency.
 */
#if (STM32_LPTIM2SEL == STM32_LPTIM2SEL_PCLK1) || defined(__DOXYGEN__)
  #define STM32_LPTIM2CLK           hal_lld_get_clock_point(CLK_PCLK1)

#elif STM32_LPTIM2SEL == STM32_LPTIM2SEL_LSI
  #define STM32_LPUART1CLK          STM32_LSICLK

#elif STM32_LPTIM2SEL == STM32_LPTIM2SEL_PLL3R
  #define STM32_LPUART1CLK          STM32_HSI16CLK

#elif STM32_LPTIM2SEL == STM32_LPTIM2SEL_LSE
  #define STM32_LPTIM2CLK           STM32_LSECLK

#else
  #error "invalid source selected for LPTIM2 clock"
#endif

/**
 * @brief   LPTIM3/4 clock frequency.
 */
#if (STM32_LPTIM34SEL == STM32_LPTIM34SEL_MSIK) || defined(__DOXYGEN__)
  #define STM32_LPTIM3CLK           hal_lld_get_clock_point(CLK_MSIK)
  #define STM32_LPTIM4CLK           hal_lld_get_clock_point(CLK_MSIK)

#elif STM32_LPTIM34SEL == STM32_LPTIM34SEL_LSI
  #define STM32_LPUART1CLK          STM32_LSICLK

#elif STM32_LPTIM34SEL == STM32_LPTIM34SEL_PLL3R
  #define STM32_LPUART1CLK          STM32_HSI16CLK

#elif STM32_LPTIM34SEL == STM32_LPTIM34SEL_LSE
  #define STM32_LPTIM2CLK           STM32_LSECLK

#else
  #error "invalid source selected for LPTIM2 clock"
#endif

/**
 * @brief   SPI1 clock frequency.
 */
#if (STM32_SPI1SEL == STM32_SPI1SEL_PCLK2) || defined(__DOXYGEN__)
  #define STM32_SPI1CLK             hal_lld_get_clock_point(CLK_PCLK2)

#elif STM32_SPI1SEL == STM32_SPI1SEL_MSIK
  #define STM32_SPI1CLK             hal_lld_get_clock_point(CLK_MSIK)

#else
  #error "invalid source selected for SPI1 clock"
#endif

/**
 * @brief   SPI2 clock frequency.
 */
#if (STM32_SPI2SEL == STM32_SPI2SEL_PCLK1) || defined(__DOXYGEN__)
  #define STM32_SPI2CLK             hal_lld_get_clock_point(CLK_PCLK1)

#elif STM32_SPI2SEL == STM32_SPI2SEL_MSIK
  #define STM32_SPI2CLK             hal_lld_get_clock_point(CLK_MSIK)

#else
  #error "invalid source selected for SPI2 clock"
#endif

/**
 * @brief   SPI3 clock frequency.
 */
#if (STM32_SPI3SEL == STM32_SPI3SEL_PCLK1) || defined(__DOXYGEN__)
  #define STM32_SPI3CLK             hal_lld_get_clock_point(CLK_PCLK1)

#elif STM32_SPI3SEL == STM32_SPI3SEL_MSIK
  #define STM32_SPI3CLK             hal_lld_get_clock_point(CLK_MSIK)

#else
  #error "invalid source selected for SPI3 clock"
#endif

/**
 * @brief   OCTOSPI clock frequency.
 */
#if (STM32_OCTOSPISEL == STM32_OCTOSPISEL_SYSCLK) || defined(__DOXYGEN__)
  #define STM32_OSPICLK             hal_lld_get_clock_point(CLK_SYSCLK)

#elif STM32_OCTOSPISEL == STM32_OCTOSPISEL_MSIK
  #define STM32_OSPICLK             hal_lld_get_clock_point(CLK_MSIK)

#else
  #error "invalid source selected for OCTOSPI clock"
#endif

/**
 * @brief   SYSTICK clock frequency.
 */
#if (STM32_SYSTICKSEL == STM32_SYSTICKSEL_HCLKDIV8) || defined(__DOXYGEN__)
  #define STM32_SYSTICKCLK          (hal_lld_get_clock_point(CLK_HCLK) / 8U)

#elif STM32_SYSTICKSEL == STM32_SYSTICKSEL_LSI
  #define STM32_SYSTICKCLK          STM32_LSICLK

#elif STM32_SYSTICKSEL == STM32_SYSTICKSEL_LSE
  #define STM32_SYSTICKCLK          STM32_LSECLK

#else
  #error "invalid source selected for STM32_SYSTICKSEL clock"
#endif

/**
 * @brief   ICLK clock frequency.
 */
#if (STM32_ICLKSEL == STM32_ICLKSEL_HSI48) || defined(__DOXYGEN__)
  #define STM32_ICLK                STM32_HSI48CLK

#elif STM32_ICLKSEL == STM32_ICLKSEL_MSIK
  #define STM32_ICLK                hal_lld_get_clock_point(CLK_MSIK)

#elif STM32_ICLKSEL == STM32_ICLKSEL_HSE
  #define STM32_ICLK                STM32_HSECLK

#elif STM32_ICLKSEL == STM32_ICLKSEL_SYSCLK
  #define STM32_ICLK                hal_lld_get_clock_point(CLK_SYSCLK)

#else
  #error "invalid source selected for ICLK clock"
#endif

/**
 * @brief   USB clock frequency.
 */
#if (STM32_USB1SEL == STM32_USB1SEL_ICLK) || defined(__DOXYGEN__)
  #define STM32_USBCLK              STM32_ICLK

#elif STM32_USB1SEL == STM32_USB1SEL_ICLKDIV2
  #define STM32_USBCLK              (STM32_ICLK / 2U)

#else
  #error "invalid source selected for USB clock"
#endif

/**
 * @brief   SDMMC1 clock frequency.
 */
#define STM32_SDMMC1CLK             STM32_ICLK

/**
 * @brief   I2C1 clock frequency.
 */
#if (STM32_I2C1SEL == STM32_I2C1SEL_PCLK1) || defined(__DOXYGEN__)
  #define STM32_I2C1CLK             hal_lld_get_clock_point(CLK_PCLK1)

#elif STM32_I2C1SEL == STM32_I2C1SEL_MSIK
  #define STM32_I2C1CLK             hal_lld_get_clock_point(CLK_MSIK)

#else
  #error "invalid source selected for I2C1 clock"
#endif

/**
 * @brief   I2C2 clock frequency.
 */
#if (STM32_I2C2SEL == STM32_I2C2SEL_PCLK1) || defined(__DOXYGEN__)
  #define STM32_I2C2CLK             hal_lld_get_clock_point(CLK_PCLK1)

