ChibiOS/ChibiOS/os/hal/ports/STM32/STM32U3xx/hal_lld.h
#elif STM32_I2C2SEL == STM32_I2C2SEL_MSIK
  #define STM32_I2C2CLK             hal_lld_get_clock_point(CLK_MSIK)

#else
  #error "invalid source selected for I2C2 clock"
#endif

/**
 * @brief   I2C3 clock frequency.
 */
#if (STM32_I2C3SEL == STM32_I2C3SEL_PCLK3) || defined(__DOXYGEN__)
  #define STM32_I2C3CLK             hal_lld_get_clock_point(CLK_PCLK3)

#elif STM32_I2C3SEL == STM32_I2C3SEL_MSIK
  #define STM32_I2C3CLK             hal_lld_get_clock_point(CLK_MSIK)

#else
  #error "invalid source selected for I2C3 clock"
#endif

/**
 * @brief   I3C1 clock frequency.
 */
#if (STM32_I3C1SEL == STM32_I3C1SEL_PCLK1) || defined(__DOXYGEN__)
  #define STM32_I3C1CLK             hal_lld_get_clock_point(CLK_PCLK1)

#elif STM32_I3C1SEL == STM32_I3C1SEL_MSIK
  #define STM32_I3C1CLK             hal_lld_get_clock_point(CLK_MSIK)

#else
  #error "invalid source selected for I3C1 clock"
#endif

/**
 * @brief   I3C2 clock frequency.
 */
#if (STM32_I3C2SEL == STM32_I3C2SEL_PCLK3) || defined(__DOXYGEN__)
  #define STM32_I3C2CLK             hal_lld_get_clock_point(CLK_PCLK3)

#elif STM32_I3C2SEL == STM32_I3C2SEL_MSIK
  #define STM32_I3C2CLK             hal_lld_get_clock_point(CLK_MSIK)

#else
  #error "invalid source selected for I3C2 clock"
#endif

/**
 * @brief   ADCDACSEL clock frequency.
 */
#if (STM32_ADCDACSEL == STM32_ADCDACSEL_HCLK) || defined(__DOXYGEN__)
  #define STM32_ADCDACCLK           hal_lld_get_clock_point(CLK_HCLK)

#elif STM32_ADCDACSEL == STM32_ADCDACSEL_HSE
  #define STM32_ADCDACCLK           STM32_HSECLK

#elif STM32_ADCDACSEL == STM32_ADCDACSEL_MSIK
  #define STM32_ADCDACCLK           hal_lld_get_clock_point(CLK_HCLK)

#else
  #error "invalid source selected for ADCDACSEL clock"
#endif

/**
 * @brief   DAC1SELSH clock frequency.
 */
#if (STM32_DAC1SHSEL == STM32_DAC1SHSEL_LSI) || defined(__DOXYGEN__)
  #define STM32_DAC1SHSELCLK        STM32_LSICLK

#elif STM32_DAC1SHSEL == STM32_DAC1SHSEL_LSE
  #define STM32_DAC1SHSELCLK        STM32_LSECLK

#elif STM32_DAC1SHSEL == STM32_DAC1SHSEL_IGNORE
  #define STM32_DAC1SHSELCLK        0U

#else
  #error "invalid source selected for DAC1SELSH clock"
#endif

/**
 * @brief   RNG clock frequency.
 */
#if (STM32_RNGSEL == STM32_RNGSEL_HSI48) || defined(__DOXYGEN__)
  #define STM32_RNGCLK              STM32_HSI48CLK

#elif STM32_RNGSEL == STM32_RNGSEL_MSIK
  #define STM32_RNGCLK              hal_lld_get_clock_point(CLK_MSIK)

#elif STM32_RNGSEL == STM32_RNGSEL_IGNORE
  #define STM32_RNGCLK              0U

#else
  #error "invalid source selected for RNG clock"
#endif

/**
 * @brief   FDCAN1 clock frequency.
 */
#if (STM32_FDCAN1SEL == STM32_FDCAN1SEL_SYSCLK) || defined(__DOXYGEN__)
  #define STM32_FDCAN1CLK           STM32_SYSCLK

#elif STM32_FDCAN1SEL == STM32_FDCANSEL_MSIK
  #define STM32_FDCAN1CLK           hal_lld_get_clock_point(CLK_MSIK)

#else
  #error "invalid source selected for FDCAN1 clock"
#endif

/**
 * @brief   SAI1 clock frequency.
 */
#if (STM32_SAI1SEL == STM32_SAI1SEL_MSIK) || defined(__DOXYGEN__)
  #define STM32_SAI1CLK             hal_lld_get_clock_point(CLKMSIK)

#elif STM32_SAI1SEL == STM32_SAI1SEL_AUDIOCLK
  #define STM32_SAI1CLK             0 /* TODO board.h */

#elif STM32_SAI1SEL == STM32_SAI1SEL_HSE
  #define STM32_SAI1CLK             STM32_HSECLK

#else
  #error "invalid source selected for SAI1 clock"
#endif

/**
 * @brief   TIMP1CLK clock frequency.
 */
#if (STM32_PPRE1 == STM32_PPRE1_DIV1) || defined(__DOXYGEN__)
  #define STM32_TIMP1CLK                STM32_PCLK1
#else
  #define STM32_TIMP1CLK                (STM32_PCLK1 * 2)
#endif

/**
 * @brief   TIMP2CLK clock frequency.
 */
#if (STM32_PPRE2 == STM32_PPRE2_DIV1) || defined(__DOXYGEN__)
  #define STM32_TIMP2CLK            STM32_PCLK2
#else
  #define STM32_TIMP2CLK            (STM32_PCLK2 * 2)
#endif

/**
 * @brief   Clock of timers connected to APB1.
 */
#define STM32_TIMCLK1               hal_lld_get_clock_point(CLK_PCLK1TIM)

/**
 * @brief   Clock of timers connected to APB2.
 */
#define STM32_TIMCLK2               hal_lld_get_clock_point(CLK_PCLK2TIM)

/**
 * @brief   Flash settings.
 */
#if (STM32_HCLK <= STM32_0WS_THRESHOLD) || defined(__DOXYGEN__)
  #define STM32_FLASHBITS           STM32_LATENCY_0WS

#elif STM32_HCLK <= STM32_1WS_THRESHOLD
  #define STM32_FLASHBITS           STM32_LATENCY_1WS

#elif STM32_HCLK <= STM32_2WS_THRESHOLD
  #define STM32_FLASHBITS           STM32_LATENCY_2WS

#elif STM32_HCLK <= STM32_3WS_THRESHOLD
  #define STM32_FLASHBITS           STM32_LATENCY_3WS

#elif STM32_HCLK <= STM32_4WS_THRESHOLD
  #define STM32_FLASHBITS           STM32_LATENCY_4WS

#else
  #define STM32_FLASHBITS           STM32_LATENCY_5WS
#endif

/*===========================================================================*/
/* Driver data structures and types.                                         */
/*===========================================================================*/

#if defined(HAL_LLD_USE_CLOCK_MANAGEMENT) || defined(__DOXYGEN__)
/**
 * @brief   Type of PLL configuration registers.
 */
typedef struct {
  uint32_t          cfgr;
  uint32_t          divr;
  uint32_t          frac;
} stm32_pll_regs_t;

/**
 * @brief   Type of a clock configuration structure.
 */
typedef struct {
  uint32_t          pwr_voscr;
  uint32_t          pwr_vmcr;
  uint32_t          rcc_cr;
  uint32_t          rcc_cfgr1;
  uint32_t          rcc_cfgr2;
  uint32_t          flash_acr;
#if STM32_RCC_HAS_PLL3 || defined(__DOXYGEN__)
  stm32_pll_regs_t  plls[3];
#else
  stm32_pll_regs_t  plls[2];
#endif
} halclkcfg_t;
#endif /* defined(HAL_LLD_USE_CLOCK_MANAGEMENT) */

/*===========================================================================*/
/* Driver macros.                                                            */
/*===========================================================================*/

#if !defined(HAL_LLD_USE_CLOCK_MANAGEMENT)
/**
 * @brief   Returns the frequency of a clock point in Hz.
 * @note    Static implementation.
 *
 * @param[in] clkpt     clock point to be returned
 * @return              The clock point frequency in Hz or zero if the
 *                      frequency is unknown.
 *
 * @notapi
 */
#define hal_lld_get_clock_point(clkpt)                                      \
  ((clkpt) == CLK_HSI16     ? STM32_HSI16CLK        :                       \
   (clkpt) == CLK_HSI48     ? STM32_HSI48CLK        :                       \
   (clkpt) == CLK_HSE       ? STM32_HSECLK          :                       \
   (clkpt) == CLK_MSIS      ? STM32_MSISCLK         :                       \
   (clkpt) == CLK_MSIK      ? STM32_MSIKCLK         :                       \
   (clkpt) == CLK_SYSCLK    ? STM32_SYSCLK          :                       \
   (clkpt) == CLK_HCLK      ? STM32_HCLK            :                       \
   (clkpt) == CLK_PCLK1     ? STM32_PCLK1           :                       \
   (clkpt) == CLK_PCLK1TIM  ? STM32_TIMP1CLK        :                       \
   (clkpt) == CLK_PCLK2     ? STM32_PCLK2           :                       \
   (clkpt) == CLK_PCLK2TIM  ? STM32_TIMP2CLK        :                       \
   (clkpt) == CLK_PCLK3     ? STM32_PCLK3           :                       \
   (clkpt) == CLK_MCO1      ? STM32_MCO1CLK         :                       \
   (clkpt) == CLK_MCO2      ? STM32_MCO2CLK         :                       \
   0U)
#endif /* !defined(HAL_LLD_USE_CLOCK_MANAGEMENT) */

/*===========================================================================*/
/* External declarations.                                                    */
/*===========================================================================*/

/* Various helpers.*/
#include "nvic.h"
#include "cache.h"
//#include "mpu_v8m.h"
#include "stm32_isr.h"
#include "stm32_dma3.h"
#include "stm32_exti.h"
#include "stm32_rcc.h"
#include "stm32_tim.h"

#if defined(HAL_LLD_USE_CLOCK_MANAGEMENT) && !defined(__DOXYGEN__)
extern const halclkcfg_t hal_clkcfg_reset;
extern const halclkcfg_t hal_clkcfg_default;
#endif

#ifdef __cplusplus
extern "C" {
#endif
  void hal_lld_init(void);
  void stm32_clock_init(void);
#if defined(HAL_LLD_USE_CLOCK_MANAGEMENT) || defined(__DOXYGEN__)
  bool hal_lld_clock_switch_mode(const halclkcfg_t *ccp);
  halfreq_t hal_lld_get_clock_point(halclkpt_t clkpt);
#endif /* defined(HAL_LLD_USE_CLOCK_MANAGEMENT) */
#ifdef __cplusplus
}
#endif

#endif /* HAL_LLD_H */

/** @} */
